function  point= cross(antibody,p)
% ο χρήστης δίνει τα αντισώματα και την πιθανότητα διασταύρωσης
% και η συνάρτηση επιστρέφει το σημείο διασταύρωσης
   
    [~,s]=size(antibody); %s είναι το μήκους του αντισώματος
    pos_cross=rand; 
    if pos_cross<p %συγκρίνουμε την δοσμένη πιθανότητα p, με έναν ψευδοτυχαίο αριθμό για να δούμε αν θα γίνει η διασταύρωση
       k=1/(s-1); %οι πιθανές θέσεις διασταύρωσης είναι k
       r=rand;   %παίρνουμε έναν τυχαίο αριθμό  
       y=1;     %έστω ότι το σημείο διασταύρωσης είναι το πρώτο
       l=k;     
       while l<=1 % σε κάθε επανάληψη, το l δηλώνει τις συσσωρευμένες πιθανότητες
          
          if r<l   % την πρώτη φορά που ο τυχαίος αριθμός είναι μικρότερος της συγκεκριμένης συσσωρευμένης πιθανότητας, 
             point=y;   % ως σημείο διασταύρωσης επιλέγεται το συγκεκριμένο σημείο
             break;
          end
       y=y+1; %αν δεν είναι ελέγχουμε το επόμενο σημείο 
       l=l+k; % βάση της επόμενης συσσωρευμένης πιθανότητας
       end
    else point=-1;   % αν δεν συμβαίνει διασταύρωση δίνουμε ως σημείο διασταύρωσης για παράδειγμα έναν αρνητικό αριθμό
    end
end