function [f,s,mo,max] = f_evaluation(a,b)
%a είναι τα αντισώματα              
% b είναι τα αντιγώνα
%f δηλώνει την αξιολόγηση των ατόμων σε αυτή τη γενιά
%s είναι η συνολική τιμή αξιολόγησης
%mo δηλώνει τη μέση τιμή αξιολόγησης
%max δηλώνει την καλύτερη τιμή αξιολόγησης (δηλαδή την τιμή αξιολόγησης του καλύτερου αντισώματος)

[m,n]=size(a); %m είναι ο αριθμός των αντισωμάτων και z ο αριθμός των αντιγώνων
[z,y]=size(b);% ουσιαστικά το n με το y ταυτίζονται, αφού δηλώνουν το μήκος των αντισωμάτων και αντιγώνων αντίστοιχα που είναι το ίδιο
 s=0;
 max=0;% στη μεταβλητή max θα κρατήσουμε την καλύτερη τιμή αξιολόγησης (θα την έχει ένα ή περισσότερα αντισώματα)
 for i=1:m %για όσα είναι τα αντισώματα
     f(i)=0;
     for j=1:n % για όσο είναι το μήκος τους
         for k=1:z % για όσα είναι τα αντιγώνα
            c=xor(a(i,j),b(k,j)); 
            if c>0          %μέτρα τους άσσους
                f(i)=f(i)+1; 
            end
         end
     end
       s=s+f(i);
       if f(i)>max
           max=f(i);
       end
 end
 mo=s/m; % η μέση τιμή αξιολόγησης είναι ο συνολικός αριθμός των άσσων, δια το σύνολικό αριθμό των αντισωμάτων
end