function  k = mutation(antibody,p)
% ο χρήστης δίνει τα αντισώματα της νέας γενιάς και την πιθανότητα
% της μετάλλαξης και η συνάρτηση επιστρέφει τα νέα αντισώματα
 [m,n]=size(antibody);
 
 for i=1:m
     for j=1:n
        k(i,j)=antibody(i,j); %σαν k αρχικά θεωρούμε τα αντισώματα αναλλοίωτα
        r=rand;
        if r<p %αν θα συμβεί μετάλλαξη
          if antibody(i,j)<0.1 %αν το χρωμόσωμα είναι 0 γίνεται 1,
                 k(i,j)=1;
          else
             k(i,j)=0;      %αν είναι 1 γίνεται 0
          end
        end
        
     end
 end 