function  [D, s ,mo ,max] = selection(antibody, antigen) 
% ο χρήστης δίνει τα αντισώματα και τα αντιγώνα στην συνάρτηση επιλογής
% και αυτή επιστρέφει τα επιλεγμένα αντισώματα d προς διασταύρωση
% τη μέση τιμή αξιολόγησης mo
% και την τιμή αξιολόγησης του καλύτερου αντισώματος max

[z,x]=size(antibody);%z είναι ο αριθμός των αντισωμάτων και x είναι το μήκος τους
[f,s,mo,max] =f_evaluation(antibody,antigen); %η συνάρτηση αξιολόγησης επιστρέφει τις σχετικές τιμές αξιολόγησης
    % την συνολική τιμή αξιολόγησης και την μέση τιμή αξιολόγησης
sum=0;
for i=1:z
    sum=sum+f(i)/s;
    rel_value(i)=sum; %εδώ υπολογίζω τις συσσωρευμένες πιθανότητες
end


for i=1:z
    r=rand;
    for j=1:z % βρίσκουμε τα άτομα του πληθυσμού που επιλέγονται για διασταύρωση, με χρήση του τελεστή της απλής αναλογικής επιλογής
    if r<=rel_value(j)        
        D(i,1:x)=antibody(j,1:x); %D είναι αυτά τα άτομα που είναι όσα και τα αντισώματα, και αφού η διασταύρωση γίνεται ανά 2, ο αριθμός
                                  %των αντσωμάτων σε κάθε γενιά θα
          break;                  %παραμένει σταθερός
    end
    end
end
end